{
	"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/",
	"query": "1,1,3,6,15,36,91,232,603,1585,4213,11298,",
	"count": 3,
	"start": 0,
	"results": [
		{
			"number": 5043,
			"id": "M2587",
			"data": "1,0,1,1,3,6,15,36,91,232,603,1585,4213,11298,30537,83097,227475,625992,1730787,4805595,13393689,37458330,105089229,295673994,834086421,2358641376,6684761125,18985057351,54022715451,154000562758,439742222071,1257643249140",
			"name": "Riordan numbers: a(n) = (n-1)*(2*a(n-1) + 3*a(n-2))/(n+1).",
			"comment": [
				"Also called Motzkin summands or ring numbers.",
				"The old name was \"Motzkin sums\", used in certain publications. The sequence has the property that Motzkin(n) = A001006(n) = a(n) + a(n+1), e.g., A001006(4) = 9 = 3 + 6 = a(4) + a(5).",
				"Number of 'Catalan partitions', that is partitions of a set 1,2,3,...,n into parts that are not singletons and whose convex hulls are disjoint when the points are arranged on a circle (so when the parts are all pairs we get Catalan numbers). - Aart Blokhuis (aartb(AT)win.tue.nl), Jul 04 2000",
				"Number of ordered trees with n edges and no vertices of outdegree 1. For n \u003e 1, number of dissections of a convex polygon by nonintersecting diagonals with a total number of n+1 edges. - _Emeric Deutsch_, Mar 06 2002",
				"Number of Motzkin paths of length n with no horizontal steps at level 0. - _Emeric Deutsch_, Nov 09 2003",
				"Number of Dyck paths of semilength n with no peaks at odd level. Example: a(4)=3 because we have UUUUDDDD, UUDDUUDD and UUDUDUDD, where U=(1,1), D=(1,-1). Number of Dyck paths of semilength n with no ascents of length 1 (an ascent in a Dyck path is a maximal string of up steps). Example: a(4)=3 because we have UUUUDDDD, UUDDUUDD and UUDUUDDD. - _Emeric Deutsch_, Dec 05 2003",
				"Arises in Schubert calculus as follows. Let P = complex projective space of dimension n+1. Take n projective subspaces of codimension 3 in P in general position. Then a(n) is the number of lines of P intersecting all these subspaces. - F. Hirzebruch, Feb 09 2004",
				"Difference between central trinomial coefficient and its predecessor. Example: a(6) = 15 = 141 - 126 and (1 + x + x^2)^6 = ... + 126*x^5 + 141*x^6 + ... (Catalan number A000108(n) is the difference between central binomial coefficient and its predecessor.) - _David Callan_, Feb 07 2004",
				"a(n) = number of 321-avoiding permutations on [n] in which each left-to-right maximum is a descent (i.e., is followed by a smaller number). For example, a(4) counts 4123, 3142, 2143. - _David Callan_, Jul 20 2005",
				"The Hankel transform of this sequence give A000012 = [1, 1, 1, 1, 1, 1, 1, ...]; example: Det([1, 0, 1, 1; 0, 1, 1, 3; 1, 1, 3, 6; 1, 3, 6, 15]) = 1. - _Philippe Deléham_, May 28 2005",
				"The number of projective invariants of degree 2 for n labeled points on the projective line. - Benjamin J. Howard (bhoward(AT)ima.umn.edu), Nov 24 2006",
				"Define a random variable X=trA^2, where A is a 2 X 2 unitary symplectic matrix chosen from USp(2) with Haar measure. The n-th central moment of X is E[(X+1)^n] = a(n). - _Andrew V. Sutherland_, Dec 02 2007",
				"Let V be the adjoint representation of the complex Lie algebra sl(2). The dimension of the invariant subspace of the n-th tensor power of V is a(n). - Samson Black (sblack1(AT)uoregon.edu), Aug 27 2008",
				"Starting with offset 3 = iterates of M * [1,1,1,...], where M = a tridiagonal matrix with [0,1,1,1,...] in the main diagonal and [1,1,1,...] in the super and subdiagonals. - _Gary W. Adamson_, Jan 08 2009",
				"a(n) has the following standard-Young-tableaux (SYT) interpretation: binomial(n+1,k)*binomial(n-k-1,k-1)/(n+1)=f^(k,k,1^{n-2k}) where f^lambda equals the number of SYT of shape lambda. - Amitai Regev (amotai.regev(AT)weizmann.ac.il), Mar 02 2010",
				"a(n) is also the sum of the numbers of standard Young tableaux of shapes (k,k,1^{n-2k}) for all 1 \u003c= k \u003c= floor(n/2). - Amitai Regev (amotai.regev(AT)weizmann.ac.il), Mar 10 2010",
				"a(n) is the number of derangements of {1,2,...,n} having genus 0. The genus g(p) of a permutation p of {1,2,...,n} is defined by g(p)=(1/2)[n+1-z(p)-z(cp')], where p' is the inverse permutation of p, c = 234...n1 = (1,2,...,n), and z(q) is the number of cycles of the permutation q. Example: a(3)=1 because p=231=(123) is the only derangement of {1,2,3} with genus 0. Indeed, cp'=231*312=123=(1)(2)(3) and so g(p)= (1/2)(3+1-1-3)=0. - _Emeric Deutsch_, May 29 2010",
				"Apparently: Number of Dyck 2n-paths with all ascents length 2 and no descent length 2. - _David Scambler_, Apr 17 2012",
				"This is true. Proof: The mapping \"insert a peak (UD) after each upstep (U)\" is a bijection from all Dyck n-paths to those Dyck (2n)-paths in which each ascent is of length 2. It sends descents of length 1 in the n-path to descents of length 2 in the (2n)-path. But Dyck n-paths with no descents of length 1 are equinumerous with Riordan n-paths (Motzkin n-paths with no flatsteps at ground level) as follows. Given a Dyck n-path with no descents of length 1, split it into consecutive step pairs, then replace UU with U, DD with D, UD with a blue flatstep (F), DU with a red flatstep, and concatenate the new steps to get a colored Motzkin path. Each red F will be (immediately) preceded by a blue F or a D. In the latter case, transfer the red F so that it precedes the matching U of the D. Finally, erase colors to get the required Riordan path. For example, with lowercase f denoting a red flatstep, U^5 D^2 U D^4 U^4 D^3 U D^2 -\u003e (U^2, U^2, UD, DU, D^2, D^2, U^2, U^2 D^2, DU, D^2) -\u003e UUFfDDUUDfD -\u003e UUFFDDUFUDD. - _David Callan_, Apr 25 2012",
				"From _Nolan Wallach_, Aug 20 2014: (Start)",
				"Let ch[part1, part2] be the value of the character of the symmetric group on n letters corresponding to the partition part1 of n on the conjucgacy class given by part2. Let A[n] be the set of (n+1) partitions of 2n with parts 1 or 2. Then deleting the first term of the sequence one has a(n) = Sum_{k=1..n+1} binomial(n,k-1)*ch[[n,n], A[n][[k]]])/2^n. This via the Frobenius Character Formula can be interpreted as the dimension of the SL(n,C) invariants in tensor^n (wedge^2 C^n).",
				"Explanation: Let p_j denote sum (x_i)^j the sum in k variables. Then the Frobenius formula says then (p_1)^j_1 (p_2)^j_2 ... (p_r)^j_r is equal to sum(lambda, ch[lambda, 1^j_12^j_2 ... r^j_r] S_lambda) with S_lambda the Shur function corresponding to lambda. This formula implies that the coefficient of S([n,n]) in (((p_1)^1+p_2)/2)^n in its expansion in terms of Shur functions is the right hand side of our formula. If we specialize the number of variables to 2 then S[n,n](x,y)=(xy)^n. Which when restricted to y=x^(-1) is 1. That is it is 1 on SL(2).",
				"On the other hand ((p_1)^2+p_2)/2 is the complete homogeneous symmetric function of degree 2 that is tr(S^2(X)). Thus our formula for a(n) is the same as that of Samson Black above since his V is the same as S^2(C^2) as a representation of SL(2). On the other hand, if we multiply ch(lambda) by sgn you get ch(Transpose(lambda)). So ch([n,n]) becomes ch([2,...,2]) (here there are n 2's). The formula for a(n) is now (1/2^n)*Sum_{j=0..n} ch([2,..,2], 1^(2n-2j) 2^j])*(-1)^j)*binomial(n,j), which calculates the coefficient of S_(2,...,2) in (((p_1)^2-p_2)/2)^n. But ((p_1)^2-p_2)/2 in n variables is the second elementary symmetric function which is the character of wedge^2 C^n and S_(2,...,2) is 1 on SL(n).",
				"(End)",
				"a(n) = number of noncrossing partitions (A000108) of [n] that contain no singletons, also number of nonnesting partitions (A000108) of [n] that contain no singletons. - _David Callan_, Aug 27 2014",
				"From _Tom Copeland_, Nov 02 2014: (Start)",
				"Let P(x) = x/(1+x) with comp. inverse Pinv(x) = x/(1-x) = -P[-x], and C(x)= [1-sqrt(1-4x)]/2, an o.g.f. for the shifted Catalan numbers A000108, with inverse Cinv(x) = x * (1-x).",
				"Fin(x) = P[C(x)] = C(x)/[1 + C(x)] is an o.g.f. for the Fine numbers, A000957 with inverse Fin^(-1)(x) = Cinv[Pinv(x)] = Cinv[-P(-x)].",
				"Mot(x) = C[P(x)] = C[-Pinv(-x)] gives an o.g.f. for shifted A005043, the Motzkin or Riordan numbers with comp. inverse Mot^(-1)(x) = Pinv[Cinv(x)] = (x - x^2) / (1 - x + x^2) (cf. A057078).",
				"BTC(x) = C[Pinv(x)] gives A007317, a binomial transform of the Catalan numbers, with BTC^(-1)(x) = P[Cinv(x)].",
				"Fib(x) = -Fin[Cinv(Cinv(-x))] = -P[Cinv(-x)] = x + 2 x^2 + 3 x^3 + 5 x^4 + ... = (x+x^2)/[1-x-x^2] is an o.g.f. for the shifted Fibonacci sequence A000045, so the comp. inverse is Fib^(-1)(x) = -C[Pinv(-x)] = -BTC(-x) and Fib(x) = -BTC^(-1)(-x).",
				"Various relations among the o.g.f.s may be easily constructed, such as Fib[-Mot(-x)] = -P[P(-x)] = x/(1-2*x) a generating fct for 2^n.",
				"Generalizing to P(x,t) = x /(1 + t*x) and Pinv(x,t) = x /(1 - t*x) = -P(-x,t) gives other relations to lattice paths, such as the o.g.f. for A091867, C[P[x,1-t]], and that for A104597, Pinv[Cinv(x),t+1]. (End)",
				"Consistent with David Callan's comment above, A249548, provides a refinement of the Motzkin sums into the individual numbers for the non-crossing partitions he describes. - _Tom Copeland_, Nov 09 2014",
				"The number of lattice paths from (0,0) to (n,0) that do not cross below the x-axis and use up-step=(1,1) and down-steps=(1,-k) where k is a positive integer. For example, a(4) = 3: [(1,1)(1,1)(1,-1)(1,-1)], [(1,1)(1,-1)(1,1)(1,-1)] and [(1,1)(1,1)(1,1)(1,-3)]. - _Nicholas Ham_, Aug 19 2015",
				"A series created using 2*(a(n) + a(n+1)) + (a(n+1) + a(n+2)) has Hankel transform of F(2n), offset 3, F being a Fibonacci number, A001906 (Empirical observation). - _Tony Foster III_, Jul 30 2016",
				"The series a(n) + A001006(n) has Hankel transform F(2n+1), offset n=1, F being the Fibonacci bisection A001519 (empirical observation). - _Tony Foster III_, Sep 05 2016",
				"The Rubey and Stump reference proves a refinement of a conjecture of René Marczinzik, which they state as: \"The number of 2-Gorenstein algebras which are Nakayama algebras with n simple modules and have an oriented line as associated quiver equals the number of Motzkin paths of length n. Moreover, the number of such algebras having the double centraliser property with respect to a minimal faithful projective-injective module equals the number of Riordan paths, that is, Motzkin paths without level-steps at height zero, of length n.\" - _Eric M. Schmidt_, Dec 16 2017",
				"A connection to the Thue-Morse sequence: (-1)^a(n) = (-1)^A010060(n) * (-1)^A010060(n+1) = A106400(n) * A106400(n+1). - _Vladimir Reshetnikov_, Jul 21 2019",
				"Named by Bernhart (1999) after the American mathematician John Riordan (1903-1988). - _Amiram Eldar_, Apr 15 2021"
			],
			"reference": [
				"N. J. A. Sloane and Simon Plouffe, The Encyclopedia of Integer Sequences, Academic Press, 1995 (includes this sequence).",
				"D. N. Verma, Towards Classifying Finite Point-Set Configurations, preprint, 1997. [Apparently unpublished]"
			],
			"link": [
				"G. C. Greubel, \u003ca href=\"/A005043/b005043.txt\"\u003eTable of n, a(n) for n = 0..1000\u003c/a\u003e (terms 0..200 from T. D. Noe)",
				"Prarit Agarwal and June Nahmgoong, \u003ca href=\"https://arxiv.org/abs/2001.10826\"\u003eSinglets in the tensor product of an arbitrary number of Adjoint representations of SU(3)\u003c/a\u003e, arXiv:2001.10826 [math.RT], 2020.",
				"O. Aichholzer, A. Asinowski, and T. Miltzow, \u003ca href=\"http://arxiv.org/abs/1403.5546\"\u003eDisjoint compatibility graph of non-crossing matchings of points in convex position\u003c/a\u003e, arXiv preprint arXiv:1403.5546 [math.CO], 2014.",
				"M. Aigner, \u003ca href=\"http://dx.doi.org/10.1016/j.disc.2007.06.012\"\u003eEnumeration via ballot numbers\u003c/a\u003e, Discrete Math., 308 (2008), 2544-2563.",
				"Gert Almkvist, Warren Dicks, and Edward Formanek, \u003ca href=\"http://dx.doi.org/10.1016/0021-8693(85)90183-8\"\u003eHilbert series of fixed free algebras and noncommutative classical invariant theory\u003c/a\u003e, J. Algebra 93 (1985), no. 1, 189-214.",
				"D. L. Andrews, \u003ca href=\"/A005043/a005043.pdf\"\u003eLetter to N. J. A. Sloane\u003c/a\u003e, Apr 10 1978.",
				"D. L. Andrews and T. Thirunamachandran, \u003ca href=\"http://dx.doi.org/10.1063/1.434725\"\u003eOn three-dimensional rotational averages\u003c/a\u003e, J. Chem. Phys., 67 (1977), 5026-5033.",
				"D. L. Andrews and T. Thirunamachandran, \u003ca href=\"/A005043/a005043_1.pdf\"\u003eOn three-dimensional rotational averages\u003c/a\u003e, J. Chem. Phys., 67 (1977), 5026-5033. [Annotated scanned copy]",
				"J.-L. Baril, \u003ca href=\"http://www.combinatorics.org/ojs/index.php/eljc/article/view/v18i1p178\"\u003eClassical sequences revisited with permutations avoiding dotted pattern\u003c/a\u003e, Electronic Journal of Combinatorics, 18 (2011), #P178.",
				"Paul Barry, \u003ca href=\"https://arxiv.org/abs/1802.03443\"\u003eOn a transformation of Riordan moment sequences\u003c/a\u003e, arXiv:1802.03443 [math.CO], 2018.",
				"Paul Barry, \u003ca href=\"https://arxiv.org/abs/1912.01126\"\u003eRiordan arrays, the A-matrix, and Somos 4 sequences\u003c/a\u003e, arXiv:1912.01126 [math.CO], 2019.",
				"Paul Barry, \u003ca href=\"https://cs.uwaterloo.ca/journals/JIS/VOL23/Barry/barry444.html\"\u003eOn the Central Antecedents of Integer (and Other) Sequences\u003c/a\u003e, J. Int. Seq., Vol. 23 (2020), Article 20.8.3.",
				"Paul Barry and Aoife Hennessy, \u003ca href=\"https://cs.uwaterloo.ca/journals/JIS/VOL15/Barry1/barry202.html\"\u003eFour-term Recurrences, Orthogonal Polynomials and Riordan Arrays\u003c/a\u003e, Journal of Integer Sequences, 2012, article 12.4.2. - From _N. J. A. Sloane_, Sep 21 2012",
				"Frank R. Bernhart, \u003ca href=\"http://dx.doi.org/10.1016/S0012-365X(99)00054-0\"\u003eCatalan, Motzkin and Riordan numbers\u003c/a\u003e, Discr. Math., 204 (1999) 73-112.",
				"Frank R. Bernhart, \u003ca href=\"/A000296/a000296_1.pdf\"\u003eFundamental chromatic numbers\u003c/a\u003e, Unpublished. (Annotated scanned copy)",
				"Frank R. Bernhart \u0026 N. J. A. Sloane, \u003ca href=\"/A001683/a001683.pdf\"\u003eCorrespondence, 1977\u003c/a\u003e",
				"Frank R. Bernhart \u0026 N. J. A. Sloane, \u003ca href=\"/A006343/a006343.pdf\"\u003eEmails, April-May 1994\u003c/a\u003e",
				"Tom Braden and Artem Vysogorets, \u003ca href=\"https://arxiv.org/abs/1909.09888\"\u003eKazhdan-Lusztig polynomials of matroids under deletion\u003c/a\u003e, arXiv:1909.09888 [math.CO], 2019.",
				"David Callan, \u003ca href=\"http://www.stat.wisc.edu/~callan/papersother/\"\u003eRiordan numbers are differences of trinomial coefficients\u003c/a\u003e, September 25, 2006.",
				"D. Callan, \u003ca href=\"http://dx.doi.org/10.1016/j.disc.2008.11.019\"\u003ePattern avoidance in \"flattened\" partitions\u003c/a\u003e, Discrete Math., 309 (2009), 4187-4191.",
				"David Callan, \u003ca href=\"https://arxiv.org/abs/1702.06150\"\u003eBijections for Dyck paths with all peak heights of the same parity\u003c/a\u003e, arXiv:1702.06150 [math.CO], 2017.",
				"Xiang-Ke Chang, X.-B. Hu, H. Lei, and Y.-N. Yeh, \u003ca href=\"http://www.combinatorics.org/ojs/index.php/eljc/article/view/v23i1p8\"\u003eCombinatorial proofs of addition formulas\u003c/a\u003e, The Electronic Journal of Combinatorics, 23(1) (2016), #P1.8.",
				"W. Y. C. Chen, E. Y. P. Deng and L. L. M. Yang, \u003ca href=\"https://arxiv.org/abs/math/0602298\"\u003eRiordan paths and derangements\u003c/a\u003e, arXiv:math/0602298 [math.CO], 2006.",
				"Johann Cigler and Christian Krattenthaler, \u003ca href=\"https://arxiv.org/abs/2003.01676\"\u003eHankel determinants of linear combinations of moments of orthogonal polynomials\u003c/a\u003e, arXiv:2003.01676 [math.CO], 2020.",
				"Eliahu Cohen, Tobias Hansen, and Nissan Itzhaki, \u003ca href=\"http://arxiv.org/abs/1511.06623\"\u003eFrom Entanglement Witness to Generalized Catalan Numbers\u003c/a\u003e, arXiv:1511.06623 [quant-ph], 2015 (see equation (23)).",
				"Benoit Collins, Ion Nechita, and Deping Ye, \u003ca href=\"http://arxiv.org/abs/1108.1935\"\u003eThe absolute positive partial transpose property for random induced states\u003c/a\u003e, arXiv preprint arXiv:1108.1935 [math-ph], 2011.",
				"R. De Castro, A. L. Ramírez and J. L. Ramírez, \u003ca href=\"http://arxiv.org/abs/1310.2449\"\u003eApplications in Enumerative Combinatorics of Infinite Weighted Automata and Graphs\u003c/a\u003e, arXiv preprint arXiv:1310.2449 [cs.DM], 2013.",
				"D. E. Davenport, L. W. Shapiro and L. C. Woodson, \u003ca href=\"http://www.combinatorics.org/ojs/index.php/eljc/article/view/v18i2p33\"\u003eThe Double Riordan Group\u003c/a\u003e, The Electronic Journal of Combinatorics, 18(2) (2012), #P33. - From _N. J. A. Sloane_, May 11 2012",
				"E. Deutsch and B. E. Sagan, \u003ca href=\"https://arxiv.org/abs/math/0407326\"\u003eCongruences for Catalan and Motzkin numbers and related sequences\u003c/a\u003e, arXiv:math/0407326 [math.CO], 2004; J. Num. Theory 117 (2006), 191-215.",
				"I. Dolinka, J. East, and R. D. Gray, \u003ca href=\"http://arxiv.org/abs/1512.02279\"\u003eMotzkin monoids and partial Brauer monoids\u003c/a\u003e, arXiv preprint arXiv:1512.02279 [math.GR], 2015.",
				"R. Donaghey and L. W. Shapiro, \u003ca href=\"http://dx.doi.org/10.1016/0097-3165(77)90020-6\"\u003eMotzkin numbers\u003c/a\u003e, J. Combin. Theory, Series A, 23 (1977), 291-301.",
				"S. Dulucq and R. Simion, \u003ca href=\"http://dx.doi.org/10.1023/A:1008689811936\"\u003eCombinatorial statistics on alternating permutations\u003c/a\u003e, J. Algebraic Combinatorics, 8, 1998, 169-191.",
				"Mauricio Fernández, \u003ca href=\"https://doi.org/10.1007/s10659-019-09754-8\"\u003eOn the Orientation Average Based on Central Orientation Density Functions for Polycrystalline Materials\u003c/a\u003e, Journal of Elasticity (2019).",
				"Francesc Fite, Kiran S. Kedlaya, Victor Rotger and Andrew V. Sutherland, \u003ca href=\"http://arxiv.org/abs/1110.6638\"\u003eSato-Tate distributions and Galois endomorphism modules in genus 2\u003c/a\u003e, arXiv preprint arXiv:1110.6638 [math.NT], 2011.",
				"Yibo Gao, \u003ca href=\"https://arxiv.org/abs/1910.08872\"\u003ePrincipal specializations of Schubert polynomials and pattern containment\u003c/a\u003e, arXiv:1910.08872 [math.CO], 2019.",
				"Juan B. Gil and Jordan O. Tirrell, \u003ca href=\"https://arxiv.org/abs/1806.09065\"\u003eA simple bijection for classical and enhanced k-noncrossing partitions\u003c/a\u003e, arXiv:1806.09065 [math.CO], 2018. Also Discrete Mathematics (2019) Article 111705. doi:10.1016/j.disc.2019.111705",
				"Phil Hanlon, \u003ca href=\"http://dx.doi.org/10.1090/S0002-9947-1982-0662044-8\"\u003eCounting interval graphs\u003c/a\u003e, Trans. Amer. Math. Soc. 272 (1982), no. 2, 383-426.",
				"B. Howard, J. Millson, A. Snowden and R. Vakil, \u003ca href=\"http://arXiv.org/abs/math.AG/0505096\"\u003eThe projective invariants of ordered points on the line\u003c/a\u003e, arXiv:math.AG/0505096, 2005.",
				"INRIA Algorithms Project, \u003ca href=\"http://ecs.inria.fr/services/structure?nbr=423\"\u003eEncyclopedia of Combinatorial Structures 423\u003c/a\u003e",
				"Kiran S. Kedlaya and Andrew V. Sutherland, \u003ca href=\"http://arXiv.org/abs/0803.4462\"\u003eHyperelliptic curves, L-polynomials and random matrices\u003c/a\u003e, arXiv:0803.4462 [math.NT], 2008-2010.",
				"Hana Kim and R. P. Stanley, \u003ca href=\"http://www-math.mit.edu/~rstan/papers/hextrees.pdf\"\u003eA refined enumeration of hex trees and related polynomials\u003c/a\u003e, Preprint 2015, European Journal of Combinatorics, Volume 54, May 2016, Pages 207-219..",
				"Sergey Kitaev, Pavel Salimov, Christopher Severs, and Henning Ulfarsson, \u003ca href=\"http://arxiv.org/abs/1202.1790\"\u003eRestricted rooted non-separable planar maps\u003c/a\u003e, arXiv preprint arXiv:1202.1790 [math.CO], 2012.",
				"S. Kitaev, P. Salimov, C. Severs and H. Ulfarsson, \u003ca href=\"http://staff.ru.is/henningu/papers/maps/maps.pdf\"\u003eRestricted non-separable planar maps and some pattern avoiding permutations\u003c/a\u003e, 2012. - From _N. J. A. Sloane_, Jan 01 2013",
				"D. E. Knuth, \u003ca href=\"/A001006/a001006_3.pdf\"\u003eLetter to L. W. Shapiro, R. K. Guy. N. J. A. Sloane, R. P. Stanley, H. Wilf regarding A001006 and A005043\u003c/a\u003e",
				"J. W. Layman, \u003ca href=\"http://www.cs.uwaterloo.ca/journals/JIS/VOL4/LAYMAN/hankel.html\"\u003eThe Hankel Transform and Some of its Properties\u003c/a\u003e, J. Integer Sequences, 4 (2001), #01.1.5.",
				"Boyu Li, \u003ca href=\"https://uwspace.uwaterloo.ca/bitstream/handle/10012/8179/Boyu_Li.pdf?sequence=1\"\u003eAsymptotic Distributions for Block Statistics on Non-crossing Partitions\u003c/a\u003e, Master's Thesis, Univ. Waterloo, 2013.",
				"Nanna Holmgaard List, Timothé Romain Léo Melin, Martin van Horn, and Trond Saue, \u003ca href=\"https://arxiv.org/abs/2001.10738\"\u003eBeyond the electric-dipole approximation in simulations of X-ray absorption spectroscopy: Lessons from relativistic theory\u003c/a\u003e, arXiv:2001.10738 [physics.chem-ph], 2020.",
				"Piera Manara and Claudio Perelli Cippo, \u003ca href=\"http://www.mat.unisi.it/newsito/puma/public_html/22_2/manara_perelli-cippo.pdf\"\u003eThe fine structure of 4321 avoiding involutions and 321 avoiding involutions\u003c/a\u003e, PU. M. A. Vol. 22 (2011), 227-238.",
				"Peter McCalla and Asamoah Nkwanta, \u003ca href=\"https://arxiv.org/abs/1901.07092\"\u003eCatalan and Motzkin Integral Representations\u003c/a\u003e, arXiv:1901.07092 [math.NT], 2019.",
				"Zhousheng Mei and Suijie Wang, \u003ca href=\"https://arxiv.org/abs/1804.06265\"\u003ePattern Avoidance of Generalized Permutations\u003c/a\u003e, arXiv:1804.06265 [math.CO], 2018.",
				"J. Menashe,  \u003ca href=\"https://www.whitman.edu/mathematics/SeniorProjectArchive/2007/menashjv.pdf\"\u003eBijections on Riordan objects\u003c/a\u003e [From Tom Copeland, Nov 07 2014]",
				"D. Merlini, D. G. Rogers, R. Sprugnoli and M. C. Verri, \u003ca href=\"http://dx.doi.org/10.4153/CJM-1997-015-x\"\u003eOn some alternative characterizations of Riordan arrays\u003c/a\u003e, Canad. J. Math., 49 (1997), 301-320.",
				"S. Morrison, E. Peters, and N. Snyder, \u003ca href=\"http://arxiv.org/abs/1501.06869\"\u003eCategories generated by a trivalent vertex\u003c/a\u003e, arXiv preprint arXiv:1501.06869 [math.QA], 2015.",
				"Jocelyn Quaintance and Harris Kwong, \u003ca href=\"http://www.emis.de/journals/INTEGERS/papers/n29/n29.Abstract.html\"\u003eA combinatorial interpretation of the Catalan and Bell number difference tables\u003c/a\u003e, Integers, 13 (2013), #A29.",
				"J. Riordan, \u003ca href=\"http://dx.doi.org/10.1016/S0097-3165(75)80010-0\"\u003eEnumeration of plane trees by branches and endpoints\u003c/a\u003e, J. Combinat. Theory, Ser A, 19, 214-222, 1975.",
				"E. Rowland and R. Yassawi, \u003ca href=\"http://arxiv.org/abs/1310.8635\"\u003eAutomatic congruences for diagonals of rational functions\u003c/a\u003e, arXiv preprint arXiv:1310.8635 [math.NT], 2013.",
				"E. Royer, \u003ca href=\"http://www.carva.org/emmanuel.royer\"\u003eInterpretation combinatoire des moments negatifs des valeurs de fonctions L au bord de la bande critique\u003c/a\u003e",
				"E. Royer, \u003ca href=\"http://dx.doi.org/10.1016/S0012-9593(03)00024-7\"\u003eInterprétation combinatoire des moments négatifs des valeurs de fonctions L au bord de la bande critique\u003c/a\u003e, Ann. Sci. Ecole Norm. Sup. (4) 36 (2003), no. 4, 601-620.",
				"Martin Rubey and Christian Stump, \u003ca href=\"https://arxiv.org/abs/1708.05092\"\u003eDouble deficiencies of Dyck paths via the Billey-Jockusch-Stanley bijection\u003c/a\u003e, arXiv:1708.05092 [math.CO], 2017.",
				"J. Salas and A. D. Sokal, \u003ca href=\"http://arxiv.org/abs/0711.1738\"\u003eTransfer Matrices and Partition-Function Zeros for Antiferromagnetic Potts Models. V. Further Results for the Square-Lattice Chromatic Polynomial\u003c/a\u003e, J. Stat. Phys. 135 (2009) 279-373, arXiv:0711.1738 [math.QA]. Mentions this sequence. - _N. J. A. Sloane_, Mar 14 2014",
				"L. W. Shapiro \u0026 N. J. A. Sloane, \u003ca href=\"/A006318/a006318_1.pdf\"\u003eCorrespondence, 1976\u003c/a\u003e",
				"L. W. Shapiro and C. J. Wang, \u003ca href=\"https://cs.uwaterloo.ca/journals/JIS/VOL12/Shapiro/shapiro7.html\"\u003eA bijection between 3-Motzkin paths and Schroder paths with no peak at odd height\u003c/a\u003e, JIS 12 (2009) 09.3.2.",
				"M. Shattuck, \u003ca href=\"http://ami.ektf.hu/uploads/papers/finalpdf/AMI_42_from93to101.pdf\"\u003eOn the zeros of some polynomials with combinatorial coefficients\u003c/a\u003e, Annales Mathematicae et Informaticae, 42 (2013) pp. 93-101.",
				"H. C. H. Schubert, \u003ca href=\"http://dx.doi.org/10.1007/BF01446537\"\u003eAllgemeine Anzahlfunctionen für Kegelschnitte, Flächen und Räume zweiten Grades in n Dimensionen\u003c/a\u003e, Math. Annalen, June 1894, Volume 45, Issue 2, pp 153-206.",
				"Hua Sun and Yi Wang, \u003ca href=\"https://cs.uwaterloo.ca/journals/JIS/VOL17/Wang/wang11.html\"\u003eA Combinatorial Proof of the Log-Convexity of Catalan-Like Numbers\u003c/a\u003e, J. Int. Seq. 17 (2014) # 14.5.2",
				"Yidong Sun and Fei Ma, \u003ca href=\"http://arxiv.org/abs/1305.2015\"\u003eMinors of a Class of Riordan Arrays Related to Weighted Partial Motzkin Paths\u003c/a\u003e, arXiv preprint arXiv:1305.2015 [math.CO], 2013.",
				"Chao-Jen Wang, \u003ca href=\"http://people.brandeis.edu/~gessel/homepage/students/wangthesis.pdf\"\u003eApplications of the Goulden-Jackson cluster method to counting Dyck paths by occurrences of subwords\u003c/a\u003e.",
				"Eric Weisstein's World of Mathematics, \u003ca href=\"http://mathworld.wolfram.com/IsotropicTensor.html\"\u003eIsotropic Tensor.\u003c/a\u003e",
				"F. Yano and H. Yoshida, \u003ca href=\"http://dx.doi.org/10.1016/j.disc.2007.03.050\"\u003eSome set partition statistics in non-crossing partitions and generating functions\u003c/a\u003e, Discr. Math., 307 (2007), 3147-3160."
			],
			"formula": [
				"a(n) = Sum_{k=0..n} (-1)^(n-k)*binomial(n, k)*A000108(k). a(n) = (1/(n+1)) * Sum_{k=0..ceiling(n/2)} binomial(n+1, k)*binomial(n-k-1, k-1), for n \u003e 1. - _Len Smiley_. [Comment from Amitai Regev (amitai.regev(AT)weizmann.ac.il), Mar 02 2010: the latter sum should be over the range k=1..floor(n/2).]",
				"G.f.: (1 + x - sqrt(1-2*x-3*x^2))/(2*x*(1+x)).",
				"G.f.: 2/(1+x+sqrt(1-2*x-3*x^2)). - Paul Peart (ppeart(AT)fac.howard.edu), May 27 2000",
				"a(n+1) + (-1)^n = a(0)*a(n) + a(1)*a(n-1) + ... + a(n)*a(0). - Bernhart",
				"a(n) = (1/(n+1)) * Sum_{i} (-1)^i*binomial(n+1, i)*binomial(2*n-2*i, n-i). - Bernhart",
				"G.f. A(x) satisfies A = 1/(1+x) + x*A^2.",
				"E.g.f.: exp(x)*(BesselI(0, 2*x) - BesselI(1, 2*x)). - _Vladeta Jovovic_, Apr 28 2003",
				"a(n) = A001006(n-1) - a(n-1).",
				"a(n+1) = Sum_{k=0..n} (-1)^k*A026300(n, k), where A026300 is the Motzkin triangle.",
				"a(n) = Sum_{k=0..n} (-1)^k*binomial(n, k)*binomial(k, floor(k/2)). - _Paul Barry_, Jan 27 2005",
				"a(n) = Sum_{k\u003e=0} A086810(n-k, k). - _Philippe Deléham_, May 30 2005",
				"a(n+2) = Sum_{k\u003e=0} A064189(n-k, k). - _Philippe Deléham_, May 31 2005",
				"Moment representation: a(n) = (1/(2*Pi))*Int(x^n*sqrt((1+x)(3-x))/(1+x),x,-1,3). - _Paul Barry_, Jul 09 2006",
				"Inverse binomial transform of A000108 (Catalan numbers). - _Philippe Deléham_, Oct 20 2006",
				"a(n) = (2/Pi)* Integral_{t_0..Pi} (4*cos^2(x)-1)^n*sin^2(x) dx. - _Andrew V. Sutherland_, Dec 02 2007",
				"G.f.: 1/(1-x^2/(1-x-x^2/(1-x-x^2/(1-x-x^2/(1-.....(continued fraction). - _Paul Barry_, Jan 22 2009",
				"G.f.: 1/(1+x-x/(1-x/(1+x-x/(1-x/(1+x-x/(1-... (continued fraction). - _Paul Barry_, May 16 2009",
				"G.f.: 1/(1-x^2/(1-x/(1-x/(1-x^2/(1-x/(1-x/(1-x^2/(1-x/(1-... (continued fraction). - _Paul Barry_, Mar 02 2010",
				"a(n) = -(-1)^n * hypergeom([1/2, n+2],[2],4/3) / sqrt(-3). - _Mark van Hoeij_, Jul 02 2010",
				"a(n) = (-1)^n*hypergeometric([-n,1/2],[2],4). - _Peter Luschny_, Aug 15 2012",
				"Let A(x) be the g.f., then x*A(x) is the reversion of x/(1 + x^2*Sum_{k\u003e=0} x^k); see A215340 for the correspondence to Dyck paths without length-1 ascents. - _Joerg Arndt_, Aug 19 2012 and Apr 16 2013",
				"a(n) ~ 3^(n+3/2)/(8*sqrt(Pi)*n^(3/2)). - _Vaclav Kotesovec_, Oct 02 2012",
				"G.f.: 2/(1+x+1/G(0)), where G(k)= 1 + x*(2+3*x)*(4*k+1)/( 4*k+2 - x*(2+3*x)*(4*k+2)*(4*k+3)/(x*(2+3*x)*(4*k+3) + 4*(k+1)/G(k+1) )); (continued fraction). - _Sergei N. Gladkovskii_, Jul 05 2013",
				"D-finite (an alternative): (n+1)*a(n) = 3*(n-2)*a(n-3) + (5*n-7)*a(n-2) + (n-2)*a(n-1), n \u003e= 3. - _Fung Lam_, Mar 22 2014",
				"Asymptotics: a(n) = 3^(n+2)/sqrt(3*n*Pi)/(8*n)*(1-21/(16*n) + O(1/n^2)) (with contribution by Vaclav Kotesovec). - _Fung Lam_, Mar 22 2014",
				"a(n) = T(2*n-1,n)/n, where T(n,k) = triangle of A180177. - _Vladimir Kruchinin_, Sep 23 2014",
				"a(n) = (-1)^n*JacobiP(n,1,-n-3/2,-7)/(n+1). - _Peter Luschny_, Sep 23 2014",
				"a(n) = Sum_{k=0..n} C(n,k)*(C(k,n-k)-C(k,n-k-1)). - _Peter Luschny_, Oct 01 2014",
				"a(n) = A002426(n) - A005717(n), n \u003e 0. - _Mikhail Kurkov_, Feb 24 2019",
				"a(n) = A309303(n) + A309303(n+1). - _Vladimir Reshetnikov_, Jul 22 2019"
			],
			"example": [
				"a(5)=6 because the only dissections of a polygon with a total number of 6 edges are: five pentagons with one of the five diagonals and the hexagon with no diagonals.",
				"G.f. = 1 + x^2 + x^3 + 3*x^4 + 6*x^5 + 15*x^6 + 36*x^7 + 91*x^8 + 232*x^9 + ..."
			],
			"maple": [
				"A005043 := proc(n) option remember; if n \u003c= 1 then 1-n else (n-1)*(2*A005043(n-1)+3*A005043(n-2))/(n+1); fi; end;",
				"Order := 20: solve(series((x-x^2)/(1-x+x^2),x)=y,x); # outputs g.f."
			],
			"mathematica": [
				"a[0]=1; a[1]=0; a[n_]:= a[n] = (n-1)*(2*a[n-1] + 3*a[n-2])/(n+1); Table[ a[n], {n, 0, 30}] (* _Robert G. Wilson v_, Jun 14 2005 *)",
				"Table[(-3)^(1/2)/6 * (-1)^n*(3*Hypergeometric2F1[1/2,n+1,1,4/3]+ Hypergeometric2F1[1/2,n+2,1,4/3]), {n,0,32}] (* cf. _Mark van Hoeij_ in A001006 *) (* _Wouter Meeussen_, Jan 23 2010 *)",
				"RecurrenceTable[{a[0]==1,a[1]==0,a[n]==(n-1) (2a[n-1]+3a[n-2])/(n+1)},a,{n,30}] (* _Harvey P. Dale_, Sep 27 2013 *)",
				"a[ n_]:= SeriesCoefficient[2/(1+x +Sqrt[1-2x-3x^2]), {x, 0, n}]; (* _Michael Somos_, Aug 21 2014 *)",
				"a[ n_]:= If[n\u003c0, 0, 3^(n+3/2) Hypergeometric2F1[3/2, n+2, 2, 4]/I]; (* _Michael Somos_, Aug 21 2014 *)",
				"Table[3^(n+3/2) CatalanNumber[n] (4(5+2n)Hypergeometric2F1[3/2, 3/2, 1/2-n, 1/4] -9 Hypergeometric2F1[3/2, 5/2, 1/2 -n, 1/4])/(4^(n+3) (n+1)), {n, 0, 31}] (* _Vladimir Reshetnikov_, Jul 21 2019 *)"
			],
			"program": [
				"(PARI) {a(n) = if( n\u003c0, 0, n++; polcoeff( serreverse( (x - x^3) / (1 + x^3) + x * O(x^n)), n))}; /* _Michael Somos_, May 31 2005 */",
				"(Maxima) a[0]:1$",
				"a[1]:0$",
				"a[n]:=(n-1)*(2*a[n-1]+3*a[n-2])/(n+1)$",
				"makelist(a[n],n,0,12); /* _Emanuele Munarini_, Mar 02 2011 */",
				"(Haskell)",
				"a005043 n = a005043_list !! n",
				"a005043_list = 1 : 0 : zipWith div",
				"   (zipWith (*) [1..] (zipWith (+)",
				"       (map (* 2) $ tail a005043_list) (map (* 3) a005043_list))) [3..]",
				"-- _Reinhard Zumkeller_, Jan 31 2012",
				"(PARI) N=66; Vec(serreverse(x/(1+x*sum(k=1,N,x^k))+O(x^N))) \\\\ _Joerg Arndt_, Aug 19 2012",
				"(Sage)",
				"A005043 = lambda n: (-1)^n*jacobi_P(n,1,-n-3/2,-7)/(n+1)",
				"[simplify(A005043(n)) for n in (0..29)]",
				"# _Peter Luschny_, Sep 23 2014",
				"(Sage)",
				"def ms():",
				"    a, b, c, d, n = 0, 1, 1, -1, 1",
				"    yield 1",
				"    while True:",
				"        yield -b + (-1)^n*d",
				"        n += 1",
				"        a, b = b, (3*(n-1)*n*a+(2*n-1)*n*b)/((n+1)*(n-1))",
				"        c, d = d, (3*(n-1)*c-(2*n-1)*d)/n",
				"A005043 = ms()",
				"print([next(A005043) for _ in range(32)]) # _Peter Luschny_, May 16 2016"
			],
			"xref": [
				"Row sums of triangle A020474, first differences of A082395.",
				"First diagonal of triangular array in A059346.",
				"Binomial transform of A126930. - _Philippe Deléham_, Nov 26 2009",
				"The Hankel transform of a(n+1) is A128834. The Hankel transform of a(n+2) is floor((2*n+4)/3) = A004523(n+2). - _Paul Barry_, Mar 08 2011",
				"The Kn11 triangle sums of triangle A175136 lead to A005043(n+2), while the Kn12(n) = A005043(n+4)-2^(n+1), Kn13(n) = A005043(n+6)-(n^2+9*n+56)*2^(n-2) and the Kn4(n) = A005043(2*n+2) = A099251(n+1) triangle sums are related to the sequence given above. For the definitions of these triangle sums see A180662. - _Johannes W. Meijer_, May 06 2011",
				"The self-convolution of A005043 gives A187306. - _Philippe Deléham_, Jan 28 2014",
				"Cf. A000045, A000108, A000957, A001006, A007317, A057078, A091867, A104597, A126120, A178514, A249548, A309303.",
				"Bisections: A099251, A099252."
			],
			"keyword": "nonn,easy,nice,changed",
			"offset": "0,5",
			"author": "_N. J. A. Sloane_",
			"ext": [
				"Thanks to Laura L. M. Yang (yanglm(AT)hotmail.com) for a correction, Aug 29 2004",
				"Name changed to Riordan numbers following a suggestion from _Ira M. Gessel_. - _N. J. A. Sloane_, Jul 24 2020"
			],
			"references": 130,
			"revision": 412,
			"time": "2021-04-15T05:26:09-04:00",
			"created": "1991-07-11T03:00:00-04:00"
		},
		{
			"number": 99323,
			"data": "1,1,0,1,-1,3,-6,15,-36,91,-232,603,-1585,4213,-11298,30537,-83097,227475,-625992,1730787,-4805595,13393689,-37458330,105089229,-295673994,834086421,-2358641376,6684761125,-18985057351,54022715451,-154000562758,439742222071,-1257643249140",
			"name": "Expansion of (sqrt(1+3*x) + sqrt(1-x))/(2*sqrt(1-x)).",
			"comment": [
				"Binomial transform is A072100. Signed Motzkin numbers with an additional leading 1.",
				"Inverse binomial transform of A001405 gives this without the initial 1. So does the binomial transform of (-1)^n*A000108(n) = [1,-1,2,-5,14,-42,...]. - _Philippe Deléham_, Mar 20 2007"
			],
			"link": [
				"C. Banderier and D. Merlini, \u003ca href=\"http://algo.inria.fr/banderier/Papers/infjumps.ps\"\u003eLattice paths with an infinite set of jumps\u003c/a\u003e, FPSAC'02 Melbourne, 2002."
			],
			"formula": [
				"a(n) = 0^n + Sum_{k=0..n-1} binomial(n-1,k)*(-1)^k*C(k), where C(k) is the k-th Catalan number.",
				"G.f.: 1 + x/(1-sqrt(x))/G(0), where G(k)= 1 +  sqrt(x)/(1  -  sqrt(x)/(1 + x/G(k+1) )); (continued fraction). - _Sergei N. Gladkovskii_, Jul 28 2013",
				"D-finite with recurrence: n*a(n) + 2*(n-2)*a(n-1) + 3*(-n+2)*a(n-2) = 0. - _R. J. Mathar_, Oct 10 2014",
				"a(n) ~ -(-1)^n * 3^(n + 1/2) / (8*sqrt(Pi)*n^(3/2)). - _Vaclav Kotesovec_, Oct 31 2017"
			],
			"maple": [
				"with(PolynomialTools): CoefficientList(convert(taylor((sqrt(1 + 3*x) + sqrt(1 - x))/2/sqrt(1 - x), x = 0, 33), polynom), x); # _Taras Goy_, Aug 07 2017"
			],
			"mathematica": [
				"CoefficientList[Series[(Sqrt[1+3x]+Sqrt[1-x])/(2Sqrt[1-x]),{x,0,40}],x] (* _Harvey P. Dale_, Feb 06 2015 *)"
			],
			"xref": [
				"Cf. A000108, A005043."
			],
			"keyword": "easy,sign",
			"offset": "0,6",
			"author": "_Paul Barry_, Oct 12 2004",
			"ext": [
				"Edited by _N. J. A. Sloane_, Oct 05 2009"
			],
			"references": 15,
			"revision": 35,
			"time": "2020-01-30T21:29:15-05:00",
			"created": "2005-02-20T03:00:00-05:00"
		},
		{
			"number": 174297,
			"data": "1,-1,-1,0,-1,1,-3,6,-15,36,-91,232,-603,1585,-4213,11298,-30537,83097,-227475,625992,-1730787,4805595,-13393689,37458330,-105089229,295673994,-834086421,2358641376,-6684761125,18985057351,-54022715451",
			"name": "First column of A174295.",
			"comment": [
				"First 6 terms as in Mobius function A008683. Signed version of A099323 with an additional leading 1."
			],
			"formula": [
				"a(n) = -(-3)^(n-3/2)*hypergeom([3/2, n-1],[2],4) for n \u003e 2 (guessed formula) [From _Mark van Hoeij_, Jul 02 2010]"
			],
			"xref": [
				"Cf. A112468, A112467, A174294, A174295, A174296, A174297."
			],
			"keyword": "sign",
			"offset": "1,7",
			"author": "_Mats Granvik_, Mar 15 2010",
			"references": 6,
			"revision": 4,
			"time": "2012-03-31T10:24:32-04:00",
			"created": "2010-06-01T03:00:00-04:00"
		}
	]
}